<a href="https://colab.research.google.com/github/ersharadpal/python/blob/main/Upload_file_data_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv("/content/sample_data/employees_data.csv")

In [ ]:
df.shape

(1000, 5)

In [ ]:
df[["employee_name","department","salary"]][200:10]

  employee_name  department  salary
0       Rahul_1   Marketing  106025
1       Pooja_2  Operations   90456
2       Karan_3          IT  140734
3        Amit_4     Finance   66172
4       Vikas_5          HR   52535
5       Rahul_6     Finance   84590
6       Priya_7     Finance   53422
7       Vikas_8  Operations   47298
8       Priya_9          HR  159820
9       Amit_10          IT   63807

In [ ]:
Result=df.nlargest(6,"salary")

In [ ]:
Result[["employee_name","department","salary"]]

    employee_name department  salary
478    Anjali_479         HR  199991
213     Pooja_214    Finance  199645
812    Anjali_813  Marketing  199467
403      Neha_404         IT  198678
296     Rahul_297      Sales  198543
304     Karan_305      Sales  198341

In [ ]:
Result.to_excel("top_6_employee.xlsx",index=False)

In [ ]:
Result2=df.nsmallest(3,"salary")

In [ ]:
Result2[["employee_name","department","salary"]]

    employee_name department  salary
63       Rahul_64         HR   20040
936      Amit_937         IT   20081
195     Karan_196    Finance   20335

In [ ]:
Result2.to_excel("bottom_3_employee.xlsx",index=False)

In [ ]:
df["age"].max()

60

In [ ]:
df.sort_values(by="salary").head(3)

     employee_id employee_name  age department  salary
63            64      Rahul_64   50         HR   20040
936          937      Amit_937   46         IT   20081
195          196     Karan_196   49    Finance   20335

In [ ]:
df.sort_values(by="age")

     employee_id employee_name  age  department  salary
570          571      Amit_571   21          HR  177291
81            82      Sneha_82   21       Sales  174018
393          394     Karan_394   21     Finance  142285
157          158      Neha_158   21          HR  149186
158          159     Sneha_159   21  Operations   67990
..           ...           ...  ...         ...     ...
608          609      Neha_609   60       Sales   66488
511          512    Anjali_512   60          IT  178102
488          489     Karan_489   60       Sales   33864
559          560     Sneha_560   60     Finance  158893
982          983      Neha_983   60     Finance  152585

[1000 rows x 5 columns]

In [ ]:
df.sort_values(by="salary").tail()

     employee_id employee_name  age department  salary
296          297     Rahul_297   47      Sales  198543
403          404      Neha_404   53         IT  198678
812          813    Anjali_813   23  Marketing  199467
213          214     Pooja_214   57    Finance  199645
478          479    Anjali_479   39         HR  199991

In [ ]:
df.head()
df.tail()

df.info()
df.describe()
df.shape
df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   employee_id    1000 non-null   int64
 1   employee_name  1000 non-null   object
 2   age            1000 non-null   int64
 3   department     1000 non-null   object
 4   salary         1000 non-null   int64
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

Index(['employee_id', 'employee_name', 'age', 'department', 'salary'], dtype='object')

In [ ]:
df[["age","employee_name"]][678:987]

     age employee_name
678   59     Vikas_679
679   48     Rahul_680
680   53    Anjali_681
681   60     Rahul_682
682   54      Amit_683
..   ...           ...
982   60      Neha_983
983   31     Rohit_984
984   26     Vikas_985
985   37      Amit_986
986   37     Sneha_987

[309 rows x 2 columns]

In [ ]:
df.loc[0,"employee_name"]

'Rahul_1'

In [ ]:
df.iloc[0,3]

'Marketing'

In [ ]:
df.loc[0,"department"]="HR"

In [ ]:
df

     employee_id employee_name  age  department  salary
0              1            HR   22          HR  106025
1              2       Pooja_2   42  Operations   90456
2              3       Karan_3   52          IT  140734
3              4        Amit_4   44     Finance   66172
4              5       Vikas_5   52          HR   52535
..           ...           ...  ...         ...     ...
995          996     Rohit_996   31   Marketing   49808
996          997     Karan_997   29  Operations  192085
997          998      Amit_998   47          HR   21360
998          999     Rohit_999   34          HR  193382
999         1000    Rahul_1000   29     Finance   48603

[1000 rows x 5 columns]

In [ ]:
df.loc[0:4,"department"]

0     Marketing
1    Operations
2            IT
3       Finance
4            HR
Name: department, dtype: object

In [ ]:
df.columns

Index(['employee_id', 'employee_name', 'age', 'department', 'salary'], dtype='object')

In [ ]:
df["age"]>40

0      False
1       True
2       True
3       True
4       True
       ...
995    False
996    False
997     True
998    False
999    False
Name: age, Length: 1000, dtype: bool

In [ ]:
df[(df["salary"]>100000) & (df["age"]>50)].head()

    employee_id employee_name  age  department  salary
2             3       Karan_3   52          IT  140734
8             9       Priya_9   58          HR  159820
16           17       Amit_17   60          IT  169091
17           18       Amit_18   53     Finance  120962
19           20      Pooja_20   58  Operations  177533

In [ ]:
df.sort_values(by="department",ascending=False)

     employee_id employee_name  age department  salary
433          434     Rahul_434   46      Sales  141075
288          289     Pooja_289   34      Sales   69875
341          342     Sneha_342   38      Sales   70003
782          783      Neha_783   48      Sales   61606
783          784     Vikas_784   24      Sales   87678
..           ...           ...  ...        ...     ...
541          542     Karan_542   58    Finance  170227
547          548     Rahul_548   27    Finance  133645
552          553    Anjali_553   52    Finance  116396
556          557    Anjali_557   41    Finance  184634
999         1000    Rahul_1000   29    Finance   48603

[1000 rows x 5 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   employee_id    1000 non-null   int64
 1   employee_name  1000 non-null   object
 2   age            1000 non-null   int64
 3   department     1000 non-null   object
 4   salary         1000 non-null   int64
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [ ]:
new=df["salary"].isnull().sum()
new

np.int64(0)

In [ ]:
mean_Salary=df["salary"].mean()

In [ ]:
new2=df.fillna(mean_Salary,inplace=True)

In [ ]:
new2.isnull().sum()

AttributeError: 'NoneType' object has no attribute 'isnull'

In [ ]:
ab=pd.read_csv("/content/employees_data (1).csv")

In [ ]:
ab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   employee_id    1000 non-null   int64
 1   employee_name  1000 non-null   object
 2   age            995 non-null    float64
 3   department     1000 non-null   object
 4   salary         989 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 39.2+ KB

In [ ]:
var=ab["age"].mean()

np.float64(110024.30434782608)

In [ ]:
ab["age"].isnull().sum()

np.int64(5)

In [ ]:
ab['age'].fillna(var,inplace=True)

NameError: name 'var' is not defined

In [ ]:
ab.isnull().sum()

employee_id       0
employee_name     0
age               5
department        0
salary           11
dtype: int64

In [ ]:
ab["salary"].fillna(11000,inplace=True)

/tmp/ipython-input-1273866777.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ab["salary"].fillna(11000,inplace=True)

In [ ]:
ab.groupby("department")["salary"].max()

department
Finance       199645.0
HR            199991.0
IT            198678.0
Marketing     199467.0
Operations    197764.0
Sales         198543.0
Name: salary, dtype: float64

In [ ]:
ab["age"].drop()

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [ ]:
ab.drop("age",axis=1) # axis 1 for column & axis =0 for "row"

     employee_id employee_name  department    salary
0              1       Rahul_1   Marketing  106025.0
1              2       Pooja_2  Operations   90456.0
2              3       Karan_3          IT  140734.0
3              4        Amit_4     Finance   66172.0
4              5       Vikas_5          HR   52535.0
..           ...           ...         ...       ...
995          996     Rohit_996   Marketing   49808.0
996          997     Karan_997  Operations  192085.0
997          998      Amit_998          HR   21360.0
998          999     Rohit_999          HR  193382.0
999         1000    Rahul_1000     Finance   48603.0

[1000 rows x 4 columns]

In [ ]:
ab["salary"]

In [ ]:
ab.dropna()

     employee_id employee_name   age  department    salary
0              1       Rahul_1  22.0   Marketing  106025.0
1              2       Pooja_2  42.0  Operations   90456.0
2              3       Karan_3  52.0          IT  140734.0
3              4        Amit_4  44.0     Finance   66172.0
4              5       Vikas_5  52.0          HR   52535.0
..           ...           ...   ...         ...       ...
995          996     Rohit_996  31.0   Marketing   49808.0
996          997     Karan_997  29.0  Operations  192085.0
997          998      Amit_998  47.0          HR   21360.0
998          999     Rohit_999  34.0          HR  193382.0
999         1000    Rahul_1000  29.0     Finance   48603.0

[995 rows x 5 columns]